frontend/views/rtransaction/_form.php

                                </div>

                            <div class=" col-sm-6">
                                <?= $form->field( $modelTransaction , "[{$i}]item_item_id")->label('الصنف')->dropDownList(\yii\helpers\ArrayHelper::map(\app\models\Ritem::find()->all(),
                                    'item_id','item_name'),['prompt'=>'اختر الصنف.....','style'=>'width:220px'
                                ])?>
---
SELECT * FROM `ritem`